src/cfe/Catalogs/http_HTTPСервисы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>http_HTTPСервисы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Журналирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьТелоЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьТелоОтвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДлинаТелаЗапроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейХраненияЗаписейЖурналов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечениеИдемпотентности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЗаголовкаИдемпотентности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольКонфликтовЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодГарантированнойРазблокировкиМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Catalogs/http_HTTPСервисы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру настроек сервиса по его имени (= имя HTTP-сервиса в конфигураторе).
// Если запись в справочнике не найдена - возвращает структуру с дефолтами
// (по сути "журналируем всё, идемпотентность выключена").
//
// Кэшируется на сеанс через http_СерверСлужебныйПовтИсп.НастройкиHTTPСервиса().
// Прямой вызов (без кэша) - этот метод. Используется когда нужны актуальные
// данные после изменения справочника.
//
// Параметры:
//  ИмяСервиса - Строка - имя HTTP-сервиса (значение Наименования элемента).
//
// Возвращаемое значение:
//  Структура - см. НастройкиПоУмолчанию() для списка полей.
//
Функция НастройкиСервиса(ИмяСервиса) Экспорт

	Результат = НастройкиПоУмолчанию();

	Если ПустаяСтрока(ИмяСервиса) Тогда
		Возврат Результат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Сервисы.Используется                          КАК Используется,
		|	Сервисы.Журналирование                        КАК Журналирование,
		|	Сервисы.РегистрироватьТелоЗапроса             КАК РегистрироватьТелоЗапроса,
		|	Сервисы.РегистрироватьТелоОтвета              КАК РегистрироватьТелоОтвета,
		|	Сервисы.МаксимальнаяДлинаТелаЗапроса          КАК МаксимальнаяДлинаТелаЗапроса,
		|	Сервисы.ДнейХраненияЗаписейЖурналов           КАК ДнейХраненияЗаписейЖурналов,
		|	Сервисы.ОбеспечениеИдемпотентности            КАК ОбеспечениеИдемпотентности,
		|	Сервисы.ИмяЗаголовкаИдемпотентности           КАК ИмяЗаголовкаИдемпотентности,
		|	Сервисы.КонтрольКонфликтовЗапросов            КАК КонтрольКонфликтовЗапросов,
		|	Сервисы.ПериодГарантированнойРазблокировкиМин КАК ПериодГарантированнойРазблокировкиМин
		|ИЗ
		|	Справочник.http_HTTPСервисы КАК Сервисы
		|ГДЕ
		|	Сервисы.Наименование = &ИмяСервиса
		|	И НЕ Сервисы.ПометкаУдаления");
	Запрос.УстановитьПараметр("ИмяСервиса", ИмяСервиса);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.НастройкиНайдены = Истина;
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Возвращает структуру с дефолтами (когда нет записи в справочнике).
//
// Возвращаемое значение:
//  Структура:
//   * НастройкиНайдены                       - Булево - есть ли элемент справочника.
//   * Используется                           - Булево - сервис включён.
//   * Журналирование                         - Булево
//   * РегистрироватьТелоЗапроса              - Булево
//   * РегистрироватьТелоОтвета               - Булево
//   * МаксимальнаяДлинаТелаЗапроса           - Число (0 = без ограничения)
//   * ДнейХраненияЗаписейЖурналов            - Число
//   * ОбеспечениеИдемпотентности             - Булево
//   * ИмяЗаголовкаИдемпотентности            - Строка
//   * КонтрольКонфликтовЗапросов             - Булево
//   * ПериодГарантированнойРазблокировкиМин - Число
//
Функция НастройкиПоУмолчанию() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("НастройкиНайдены",                     Ложь);
	Результат.Вставить("Используется",                         Истина);
	Результат.Вставить("Журналирование",                       Истина);
	Результат.Вставить("РегистрироватьТелоЗапроса",            Истина);
	Результат.Вставить("РегистрироватьТелоОтвета",             Истина);
	Результат.Вставить("МаксимальнаяДлинаТелаЗапроса",         0);
	Результат.Вставить("ДнейХраненияЗаписейЖурналов",          30);
	Результат.Вставить("ОбеспечениеИдемпотентности",           Ложь);
	Результат.Вставить("ИмяЗаголовкаИдемпотентности",          "Idempotency-Key");
	Результат.Вставить("КонтрольКонфликтовЗапросов",           Ложь);
	Результат.Вставить("ПериодГарантированнойРазблокировкиМин", 5);
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
